
[
  {
    "id": "the-ultimate-guide-to-probiotics",
    "title": "The Ultimate Guide to Probiotics and Gut Health",
    "excerpt": "Discover how probiotics work, the benefits of a healthy gut microbiome, and how to choose the right supplement for your needs.",
    "bodyHtml": "<h2>The Gut-Brain Axis</h2><p>The gut is often called the 'second brain', and for good reason. The gut-brain axis is a bidirectional communication network that links the central nervous system with the enteric nervous system. This connection means that a healthy gut can contribute to a healthy mind, influencing everything from mood to cognitive function.</p><h3>Choosing a Probiotic</h3><p>When selecting a probiotic supplement, consider the following:</p><ul><li><strong>CFU Count:</strong> Colony-Forming Units indicate the number of viable bacteria per dose. Look for supplements in the 20-50 billion CFU range.</li><li><strong>Strain Diversity:</strong> A variety of strains provides a broader range of benefits.</li><li><strong>Survivability:</strong> Ensure the strains can survive stomach acid to reach your intestines.</li></ul>",
    "coverImage": "./assets/img/post-placeholder.svg",
    "author": "Dr. Jane Doe, PhD",
    "category": "Nutrition",
    "tags": ["probiotics", "gut health", "digestion"],
    "publishedAt": "2025-10-15T00:00:00Z",
    "updatedAt": "2025-10-16T00:00:00Z"
  },
  {
    "id": "5-supplements-for-weight-loss",
    "title": "5 Science-Backed Supplements for Weight Loss",
    "excerpt": "Cut through the noise. We explore five supplements that have been scientifically shown to support weight loss and metabolic health.",
    "bodyHtml": "<h2>Beyond Diet and Exercise</h2><p>While a healthy diet and regular exercise are paramount, certain supplements can provide an extra edge in your weight loss journey.</p><ol><li><strong>Green Tea Extract:</strong> Rich in catechins, it can boost metabolism and increase fat burning.</li><li><strong>Caffeine:</strong> A well-known stimulant that can increase energy expenditure.</li><li><strong>Glucomannan:</strong> A soluble fiber that promotes feelings of fullness.</li><li><strong>Protein Powder:</strong> Helps preserve muscle mass during weight loss and increases satiety.</li><li><strong>BHB Ketones:</strong> Can support energy levels and adherence on a ketogenic diet.</li></ol>",
    "coverImage": "./assets/img/post-placeholder.svg",
    "author": "health42 Editorial",
    "category": "Diets & Weight Loss",
    "tags": ["weight loss", "fat loss", "metabolism"],
    "publishedAt": "2025-10-10T00:00:00Z",
    "updatedAt": "2025-10-10T00:00:00Z"
  },
  {
    "id": "understanding-collagen",
    "title": "Understanding Collagen: Benefits for Skin, Hair, and Joints",
    "excerpt": "Collagen is the most abundant protein in the body, but what does it actually do? We break down the science behind collagen supplementation.",
    "bodyHtml": "<h2>The Body's Scaffolding</h2><p>Think of collagen as the scaffolding that provides strength and structure to your skin, bones, muscles, and connective tissues. As we age, our natural collagen production declines, leading to common signs of aging like wrinkles and joint pain.</p><h3>Types of Collagen</h3><p>There are over 28 types of collagen, but types I, II, and III are the most common in the human body.</p><ul><li><strong>Type I:</strong> The most prevalent, found in skin, bones, and tendons.</li><li><strong>Type II:</strong> The main component of cartilage.</li><li><strong>Type III:</strong> Found in muscles, organs, and arteries.</li></ul><p>Supplementing with hydrolyzed collagen peptides can help replenish these levels, promoting skin elasticity and joint health.</p>",
    "coverImage": "./assets/img/post-placeholder.svg",
    "author": "Dr. Emily Carter, ND",
    "category": "Beauty",
    "tags": ["collagen", "skin health", "joint pain"],
    "publishedAt": "2025-10-02T00:00:00Z",
    "updatedAt": "2025-10-02T00:00:00Z"
  }
]
